# Taps (Repositories)
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

# Brews (Formulae / Packages)
brew "awscli"                                       # Official Amazon AWS command-line interface
brew "bat"                                          # Clone of cat(1) with syntax highlighting and Git integration
brew "cloudflared"                                  # Cloudflare Tunnel client (formerly Argo Tunnel)
brew "curl"                                         # Get a file from an HTTP, HTTPS or FTP server
brew "dnsmasq"                                      # Lightweight DNS forwarder and DHCP server
brew "docker-compose"                               # Isolated development environments using Docker
brew "exa"                                          # Modern replacement for 'ls'
brew "ffmpeg"                                       # Play, record, convert, and stream audio and video
brew "fzf"                                          # Command-line fuzzy finder written in Go
brew "gh"                                           # GitHub command-line tool
brew "git"                                          # Distributed revision control system
brew "httpie"                                       # User-friendly cURL replacement (command-line HTTP client)
brew "jq"                                           # Lightweight and flexible command-line JSON processor
brew "less"                                         # Pager program similar to more
brew "mas"                                          # Mac App Store command-line interface
brew "nano"                                         # Free (GNU) replacement for the Pico text editor
brew "nvm"                                          # Manage multiple Node.js versions
brew "openssl@3"                                    # Cryptography and SSL/TLS Toolkit
brew "parallel"                                     # Shell command parallelization utility
brew "pyenv"                                        # Python version management
brew "pnpm"                                         # Fast, disk space efficient package manager
brew "spaceship"                                    # Zsh prompt for Astronauts
brew "tree"                                         # Display directories as trees (with optional color/HTML output)
brew "hashicorp/tap/vault"                          # Vault
brew "koekeishiya/formulae/skhd"                    # Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/yabai"                   # A tiling window manager for macOS based on binary space partitioning.
brew "oven-sh/bun/bun"                              # Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "rustup-init"                                  # Rust toolchain installer
brew "watchman"                                     # Watch files and take action when they change
brew "z"                                            # Tracks most-used directories to make cd smarter
brew "zlib"                                         # General-purpose lossless data-compression library
brew "zsh"                                          # UNIX shell (command interpreter)
brew "zsh-autosuggestions"                          # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-completions"                              # Additional completion definitions for zsh
brew "zsh-syntax-highlighting"                      # Fish shell like syntax highlighting for zsh
brew "warrensbox/tap/tfswitch"                      # Sswitch between terraform versions

# Casks (Applications)
cask "arc"                                          # Chromium based browser
cask "barrier"                                      # Open-source KVM software
cask "bartender"                                    # Menu bar icon organizer
cask "bettermouse"                                  # Utility improving 3rd party mouse performance and functionalities
cask "cryptomator"                                  # Multi-platform client-side cloud file encryption tool
cask "discord"                                      # Voice and text chat software
cask "docker"                                       # App to build and share containerized applications and microservices
cask "font-fira-code"                               # Free monospaced font with programming ligatures
cask "font-input"                                   # Fonts for code
cask "font-monaspace"                               # Superfamily of fonts for code
cask "imageoptim"                                   # Tool to optimize images to a smaller size
cask "karabiner-elements"                           # Keyboard customizer
cask "keyboardcleantool"                            # Blocks all Keyboard and TouchBar input
cask "locationsimulator"                            # Application to spoof your iOS, iPadOS or iPhoneSimulator device location
cask "mactex-no-gui"                                # Full TeX Live distribution without GUI applications
cask "mission-control-plus"                         # Manage your windows in Mission Control
cask "monitorcontrol"                               # Tool to control external monitor brightness & volume
cask "ngrok"                                        # Reverse proxy, secure introspectable tunnels to localhost
cask "obsidian"                                     # Knowledge base that works on top of a local folder of plain text Markdown files
cask "plex-media-server"                            # Home media server
cask "popclip"                                      # Used to access context-specific actions when text is selected
cask "purevpn"                                      # VPN client
cask "qbittorrent"                                  # Peer to peer Bitorrent client
cask "raspberry-pi-imager"                          # Imaging utility to install operating systems to a microSD card
cask "raycast"                                      # Control your tools with a few keystrokes
cask "react-native-debugger"                        # Standalone app for debugging React Native apps
cask "slack"                                        # Team communication and collaboration software    
cask "setapp"                                       # Collection of apps available by subscription
cask "shottr"                                       # Screenshot measurement and annotation tool
cask "spotify"                                      # Music streaming service
cask "steam"                                        # Video game digital distribution service
cask "tableplus"                                    # Native GUI tool for relational databases
cask "teamviewer"                                   # Remote access and connectivity software focused on security
cask "tor-browser"                                  # Web browser focusing on security
cask "visual-studio-code"                           # Open-source code editor
cask "vlc"                                          # Multimedia player
cask "vnc-viewer"                                   # Remote desktop application focusing on security

# Mac app store applications
# mas "Affinity Photo 2", id: 1616822987              # Graphics editor
mas "Color Picker", id: 1545870783                  # The built-in color picker
# mas "DaVinci Resolve Studio", id: 900392332         # Video editor
mas "Dropover", id: 1355679052                      # Easier drag & drop
mas "GSE SMART IPTV", id: 1293083751                # Internet Protocol TV
mas "iStat Menus", id: 1319778037                   # Menu bar system manager
mas "LimeChat", id: 414030210                       # IRC client
mas "Magnet", id: 441258766                         # Window manager through dragging to screen edges
mas "TestFlight", id: 899247664                     # App store beta testing
mas "TickTick:To-Do List, Calendar", id: 966085870  # To-do list
mas "TextSniper", id: 1528890965                    # Extract on-screen text
mas "WhatsApp", id: 1147396723                      # Insant messager and VOiP
mas "WireGuard", id: 1451685025                     # Official WireGuard VPN client
mas "Yubico Authenticator", id: 1497506650          # 2FA with Yubikey
