# Taps (Repositories)
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Brews (Formulae / Packages)
brew "awscli"                                       # Official Amazon AWS command-line interface
brew "bat"                                          # Clone of cat(1) with syntax highlighting and Git integration
brew "cocoapods"                                    # Dependency manager for Cocoa projects
brew "dnsmasq"                                      # Lightweight DNS forwarder and DHCP server
brew "docker"                                       # Pack, ship and run any application as a lightweight container
brew "docker-compose"                               # Isolated development environments using Docker
brew "exa"                                          # Modern replacement for 'ls'
brew "git"                                          # Distributed revision control system
brew "graphviz"                                     # Graph visualization software from AT&T and Bell Labs
brew "httpie"                                       # User-friendly cURL replacement (command-line HTTP client)
brew "jenv"                                         # Manage your Java environment
brew "less"                                         # Pager program similar to more
brew "mackup"                                       # Keep your Mac's application settings in sync
brew "mas"                                          # Mac App Store command-line interface
brew "nano"                                         # Free (GNU) replacement for the Pico text editor
brew "nvm"                                          # Manage multiple Node.js versions
brew "openjdk"                                      # Development kit for the Java programming language
brew "openssl@3"                                    # Cryptography and SSL/TLS Toolkit
brew "postgresql@14", restart_service: true         # Object-relational database system
brew "postgis"                                      # Adds support for geographic objects to PostgreSQL
brew "pyenv"                                        # Python version management
brew "rbenv"                                        # Ruby version manager
brew "spaceship"                                    # Zsh prompt for Astronauts
brew "watchman"                                     # Watch files and take action when they change
brew "z"                                            # Tracks most-used directories to make cd smarter
brew "zlib"                                         # General-purpose lossless data-compression library
brew "zsh"                                          # UNIX shell (command interpreter)
brew "zsh-autosuggestions"                          # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-syntax-highlighting"                      # Fish shell like syntax highlighting for zsh

# Casks (Applications)
cask "android-studio"                               # Tools for building Android applications
cask "avast-security"                               # Antivirus software
cask "barrier"                                      # Open-source KVM software
cask "corretto8"                                    # OpenJDK distribution from Amazon
cask "discord"                                      # Voice and text chat software
cask "font-fira-code"                               # Free monospaced font with programming ligatures
cask "google-chrome"                                # Web browser
cask "imageoptim"                                   # Tool to optimize images to a smaller size
cask "mactex-no-gui"                                # Full TeX Live distribution without GUI applications
cask "obsidian"                                     # Knowledge base that works on top of a local folder of plain text Markdown files
cask "pgadmin4"                                     # Administration and development platform for PostgreSQL
cask "qbittorrent"                                  # Peer to peer Bitorrent client
cask "raspberry-pi-imager"                          # Imaging utility to install operating systems to a microSD card
cask "raycast"                                      # Control your tools with a few keystrokes
cask "react-native-debugger"                        # Standalone app for debugging React Native apps
cask "scroll-reverser"                              # Choose to reverse scrolling direction individually on trackpad and mouse
cask "shottr"                                       # Screenshot measurement and annotation tool
cask "spotify"                                      # Music streaming service
cask "steam"                                        # Video game digital distribution service
cask "teamviewer"                                   # Remote access and connectivity software focused on security
cask "visual-studio-code"                           # Open-source code editor
cask "vlc"                                          # Multimedia player
cask "zulu11"                                       # OpenJDK distribution from Azul

# Mac app store applications
mas "Dropover", id: 1355679052                      # Easier drag & drop
mas "GSE SMART IPTV", id: 1293083751                # Internet Protocol TV
mas "Hidden Bar", id: 1452453066                    # Hide menu bar items
mas "iStat Menus", id: 1319778037                   # Menu bar system manager
mas "Magnet", id: 441258766                         # Window manager through dragging to screen edges
mas "Microsoft Excel", id: 462058435                # Spreadsheet software
mas "TestFlight", id: 899247664                     # App store beta testing
mas "TickTick:To-Do List, Calendar", id: 966085870  # To-do list
mas "NordVPN", id: 905953485                        # Secure & private VPN
mas "TestFlight", id: 899247664                     # MacOS beta testing
mas "TickTick", id: 966085870                       # To-do lists
mas "WhatsApp", id: 1147396723                      # Insant messager and VOiP
mas "Xcode", id: 497799835                          # Build apps for Apple devices
mas "Yubico Authenticator", id: 1497506650          # 2FA with Yubikey