# Taps (Repositories)
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Brews (Formulae / Packages)
brew "act"                                          # Run your GitHub Actions locally 🚀
brew "awscli"                                       # Official Amazon AWS command-line interface
brew "bat"                                          # Clone of cat(1) with syntax highlighting and Git integration
brew "cloudflared"                                  # Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cocoapods"                                    # Dependency manager for Cocoa projects
brew "curl"                                         # Get a file from an HTTP, HTTPS or FTP server
brew "dnsmasq"                                      # Lightweight DNS forwarder and DHCP server
brew "docker-compose"                               # Isolated development environments using Docker
brew "exa"                                          # Modern replacement for 'ls'
brew "ffmpeg"                                       # Play, record, convert, and stream audio and video
brew "fzf"                                          # Command-line fuzzy finder written in Go
brew "gh"                                           # GitHub command-line tool
brew "git"                                          # Distributed revision control system
brew "gnupg"                                        # GNU Pretty Good Privacy (PGP) package 
brew "graphviz"                                     # Graph visualization software from AT&T and Bell Labs
brew "httpie"                                       # User-friendly cURL replacement (command-line HTTP client)
brew "jenv"                                         # Manage your Java environment
brew "jq"                                           # Lightweight and flexible command-line JSON processor
brew "less"                                         # Pager program similar to more
brew "mackup"                                       # Keep your Mac's application settings in sync
brew "mas"                                          # Mac App Store command-line interface
brew "nano"                                         # Free (GNU) replacement for the Pico text editor
brew "nvm"                                          # Manage multiple Node.js versions
brew "openjdk"                                      # Development kit for the Java programming language
brew "openssl@3"                                    # Cryptography and SSL/TLS Toolkit
brew "postgresql@14"                                # Object-relational database system
brew "postgis"                                      # Adds support for geographic objects to PostgreSQL
brew "pyenv"                                        # Python version management
brew "pnpm"                                         # Fast, disk space efficient package manager
brew "rbenv"                                        # Ruby version manager
brew "spaceship"                                    # Zsh prompt for Astronauts
brew "tree"                                         # Display directories as trees (with optional color/HTML output)
brew "hashicorp/tap/vault"                          # Vault
brew "watchman"                                     # Watch files and take action when they change
brew "z"                                            # Tracks most-used directories to make cd smarter
brew "zlib"                                         # General-purpose lossless data-compression library
brew "zsh"                                          # UNIX shell (command interpreter)
brew "zsh-autosuggestions"                          # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-completions"                              # Additional completion definitions for zsh
brew "zsh-syntax-highlighting"                      # Fish shell like syntax highlighting for zsh
brew "warrensbox/tap/tfswitch"                      # Sswitch between terraform versions

# Casks (Applications)
cask "android-studio"                               # Tools for building Android applications
cask "avast-security"                               # Antivirus software
cask "barrier"                                      # Open-source KVM software
cask "bartender"                                    # Menu bar icon organizer
cask "corretto8"                                    # OpenJDK distribution from Amazon
cask "dbeaver-community"                            # Universal database tool and SQL client
cask "discord"                                      # Voice and text chat software
cask "docker"                                       # App to build and share containerized applications and microservices
cask "font-fira-code"                               # Free monospaced font with programming ligatures
cask "font-input"                                   # Fonts for code  
cask "google-chrome"                                # Web browser
cask "imageoptim"                                   # Tool to optimize images to a smaller size
cask "linearmouse"                                  # Customize mouse behavior
cask "mactex-no-gui"                                # Full TeX Live distribution without GUI applications
cask "mission-control-plus"                         # Manage your windows in Mission Control
cask "ngrok"                                        # Reverse proxy, secure introspectable tunnels to localhost
cask "obsidian"                                     # Knowledge base that works on top of a local folder of plain text Markdown files
cask "qbittorrent"                                  # Peer to peer Bitorrent client
cask "raspberry-pi-imager"                          # Imaging utility to install operating systems to a microSD card
cask "raycast"                                      # Control your tools with a few keystrokes
cask "react-native-debugger"                        # Standalone app for debugging React Native apps
cask "rewind"                                       # Record and search your screen and audio
cask "slack"                                        # Team communication and collaboration software    
cask "scroll-reverser"                              # Choose to reverse scrolling direction individually on trackpad and mouse
cask "setapp"                                       # Collection of apps available by subscription
cask "shottr"                                       # Screenshot measurement and annotation tool
cask "spotify"                                      # Music streaming service
cask "steam"                                        # Video game digital distribution service
cask "streamlabs-obs"                               # All-in-one live streaming software
cask "tailscale"                                    # Easiest, most secure way to use WireGuard and 2FA
cask "teamviewer"                                   # Remote access and connectivity software focused on security
cask "tor-browser"                                  # Web browser focusing on security
cask "visual-studio-code"                           # Open-source code editor
cask "vlc"                                          # Multimedia player
cask "vnc-viewer"                                   # Remote desktop application focusing on security
cask "zulu11"                                       # OpenJDK distribution from Azul

# Mac app store applications
# mas "Affinity Photo 2", id: 1616822987              # Graphics editor
# mas "DaVinci Resolve Studio", id: 900392332         # Video editor
mas "Dropover", id: 1355679052                      # Easier drag & drop
mas "GSE SMART IPTV", id: 1293083751                # Internet Protocol TV
mas "iStat Menus", id: 1319778037                   # Menu bar system manager
mas "Magnet", id: 441258766                         # Window manager through dragging to screen edges
mas "Microsoft Excel", id: 462058435                # Spreadsheet software
mas "TestFlight", id: 899247664                     # App store beta testing
mas "TickTick:To-Do List, Calendar", id: 966085870  # To-do list
mas "TextSniper", id: 1528890965                    # Extract on-screen text
mas "TickTick", id: 966085870                       # To-do lists
mas "WhatsApp", id: 1147396723                      # Insant messager and VOiP
mas "Xcode", id: 497799835                          # Build apps for Apple devices
mas "Yubico Authenticator", id: 1497506650          # 2FA with Yubikey
